Plan for **main** is ready.
**Branch/Commit:** refs/heads/main / ceadcc1e1040a1aa6fca365bbbc2d7ecb1cd433f
**Run:** https://github.com/JohnMonteir0/eks-with-cilium/actions/runs/20150962889

**Plan (last ~500 lines):**
```
              + "arn:aws:eks:us-east-1:107363237542:cluster/platform-prod",
            ]
          + sid       = "AllowAPIServerEndpointDiscovery"
        }
    }

  # module.karpenter.aws_eks_access_entry.node[0] will be created
  + resource "aws_eks_access_entry" "node" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "platform-prod"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = (known after apply)
      + tags              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "platform"
          + "Tier"        = "critical"
        }
      + tags_all          = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "platform"
          + "Tier"        = "critical"
        }
      + type              = "EC2_LINUX"
      + user_name         = (known after apply)
    }

  # module.karpenter.aws_eks_pod_identity_association.karpenter[0] will be updated in-place
  ~ resource "aws_eks_pod_identity_association" "karpenter" {
        id              = "a-qycm0pjtlshasprlj"
      ~ role_arn        = "arn:aws:iam::107363237542:role/KarpenterController-20251211225256439800000001" -> (known after apply)
        tags            = {
            "Environment" = "prod"
            "ManagedBy"   = "terraform"
            "Owner"       = "platform-team"
            "Project"     = "platform"
            "Tier"        = "critical"
        }
        # (6 unchanged attributes hidden)
    }

  # module.karpenter.aws_iam_policy.controller[0] will be created
  + resource "aws_iam_policy" "controller" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Karpenter controller IAM policy"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "KarpenterController-"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "platform"
          + "Tier"        = "critical"
        }
      + tags_all         = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "platform"
          + "Tier"        = "critical"
        }
    }

  # module.karpenter.aws_iam_role.controller[0] will be created
  + resource "aws_iam_role" "controller" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sts:TagSession",
                          + "sts:AssumeRole",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "pods.eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Karpenter controller IAM role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "KarpenterController-"
      + path                  = "/"
      + tags                  = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "platform"
          + "Tier"        = "critical"
        }
      + tags_all              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "platform"
          + "Tier"        = "critical"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.karpenter.aws_iam_role.node[0] will be created
  + resource "aws_iam_role" "node" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSNodeAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "platform-prod"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "platform"
          + "Tier"        = "critical"
        }
      + tags_all              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "platform"
          + "Tier"        = "critical"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.karpenter.aws_iam_role_policy_attachment.controller[0] will be created
  + resource "aws_iam_role_policy_attachment" "controller" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.karpenter.aws_iam_role_policy_attachment.node["AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "node" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "platform-prod"
    }

  # module.karpenter.aws_iam_role_policy_attachment.node["AmazonEKSWorkerNodePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "node" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "platform-prod"
    }

  # module.karpenter.aws_iam_role_policy_attachment.node["AmazonEKS_CNI_Policy"] will be created
  + resource "aws_iam_role_policy_attachment" "node" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "platform-prod"
    }

  # module.karpenter.aws_iam_role_policy_attachment.node_additional["AmazonSSMManagedInstanceCore"] will be created
  + resource "aws_iam_role_policy_attachment" "node_additional" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "platform-prod"
    }

  # module.network.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.network.data.aws_eks_cluster.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster" "this" {
      + access_config             = (known after apply)
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + compute_config            = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = "platform-prod"
      + outpost_config            = (known after apply)
      + platform_version          = (known after apply)
      + remote_network_config     = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + storage_config            = (known after apply)
      + tags                      = (known after apply)
      + upgrade_policy            = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
      + zonal_shift_config        = (known after apply)
    }

  # module.network.data.aws_eks_cluster_auth.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster_auth" "this" {
      + id    = (known after apply)
      + name  = "platform-prod"
      + token = (sensitive value)
    }

  # module.network.helm_release.cilium will be updated in-place
  ~ resource "helm_release" "cilium" {
        id                         = "cilium"
      ~ metadata                   = [
          - {
              - app_version    = "1.18.1"
              - chart          = "cilium"
              - first_deployed = 1765494372
              - last_deployed  = 1765494372
              - name           = "cilium"
              - namespace      = "kube-system"
              - notes          = <<-EOT
                    You have successfully installed Cilium with Hubble Relay and Hubble UI.
                    
                    Your release version is 1.18.1.
                    
                    For any further help, visit https://docs.cilium.io/en/v1.18/gettinghelp
                EOT
              - revision       = 1
              - values         = jsonencode(
                    {
                      - egressMasqueradeInterfaces = "eth+"
                      - endpointRoutes             = {
                          - enabled = true
                        }
                      - eni                        = {
                          - awsEnablePrefixDelegation = true
                          - enabled                   = true
                          - subnetTagsFilter          = [
                              - "cilium-pod-subnet=true",
                            ]
                        }
                      - envoy                      = {
                          - enabled = true
                        }
                      - gatewayAPI                 = {
                          - enabled = true
                        }
                      - hubble                     = {
                          - enabled = true
                          - relay   = {
                              - enabled = true
                            }
                          - tls     = {
                              - auto = {
                                  - enabled = true
                                  - method  = "helm"
                                }
                            }
                          - ui      = {
                              - enabled = true
                              - ingress = {
                                  - backendServicePort = "http"
                                  - className          = "cilium"
                                  - enabled            = true
                                  - hosts              = [
                                      - "hubble-prod.107363237542.montlabz.com",
                                    ]
                                  - paths              = [
                                      - {
                                          - path     = "/"
                                          - pathType = "Prefix"
                                        },
                                    ]
                                }
                            }
                        }
                      - ingressController          = {
                          - enabled          = true
                          - loadbalancerMode = "shared"
                          - service          = {
                              - annotations = {
                                  - "service.beta.kubernetes.io/aws-load-balancer-scheme" = "internet-facing"
                                  - "service.beta.kubernetes.io/aws-load-balancer-type"   = "network"
                                }
                              - type        = "LoadBalancer"
                            }
                        }
                      - ipam                       = {
                          - mode = "eni"
                        }
                      - k8sServiceHost             = "BDE65F7C160D17E4F8D1D0B0F819E0D9.gr7.us-east-1.eks.amazonaws.com"
                      - k8sServicePort             = 443
                      - kubeProxyReplacement       = true
                      - routingMode                = "native"
                    }
                )
              - version        = "1.18.1"
            },
        ] -> (known after apply)
        name                       = "cilium"
        # (27 unchanged attributes hidden)

      - set {
          - name  = "hubble.ui.ingress.hosts[0]" -> null
          - value = "hubble-prod.107363237542.montlabz.com" -> null
            # (1 unchanged attribute hidden)
        }
      - set {
          - name  = "k8sServiceHost" -> null
          - value = "BDE65F7C160D17E4F8D1D0B0F819E0D9.gr7.us-east-1.eks.amazonaws.com" -> null
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "hubble.ui.ingress.hosts[0]"
          + value = (known after apply)
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "k8sServiceHost"
          + value = (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (26 unchanged blocks hidden)
    }

  # module.network.helm_release.karpenter will be created
  + resource "helm_release" "karpenter" {
      + atomic                     = true
      + chart                      = "karpenter"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "karpenter"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "oci://public.ecr.aws/karpenter"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.1.6"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "settings.clusterEndpoint"
          + value = "https://BDE65F7C160D17E4F8D1D0B0F819E0D9.gr7.us-east-1.eks.amazonaws.com"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "settings.clusterName"
          + value = "platform-prod"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "settings.interruptionQueue"
          + value = "Karpenter-platform-prod"
            # (1 unchanged attribute hidden)
        }
    }

  # module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_autoscaling_group.this[0] will be updated in-place
  ~ resource "aws_autoscaling_group" "this" {
        id                               = "karpenter-prod-2025121123055658710000001e"
        name                             = "karpenter-prod-2025121123055658710000001e"
        # (31 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-088d02298e5d8e2b2"
            name    = "karpenter-2025121123055098090000001c"
          ~ version = "1" -> (known after apply)
        }

        # (12 unchanged blocks hidden)
    }

  # module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_instance_profile.this[0] will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "karpenter-prod-node-group-"
      + path        = "/"
      + role        = "karpenter-prod-node-group-2025121122553687940000000e"
      + tags        = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "platform"
          + "Tier"        = "critical"
        }
      + tags_all    = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform-team"
          + "Project"     = "platform"
          + "Tier"        = "critical"
        }
      + unique_id   = (known after apply)
    }

  # module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "karpenter-prod-node-group-2025121122553687940000000e"
    }

  # module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "karpenter-prod-node-group-2025121122553687940000000e"
    }

  # module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "karpenter-prod-node-group-2025121122553687940000000e"
    }

  # module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_launch_template.this[0] will be updated in-place
  ~ resource "aws_launch_template" "this" {
      ~ default_version                      = 1 -> (known after apply)
        id                                   = "lt-088d02298e5d8e2b2"
      ~ latest_version                       = 1 -> (known after apply)
        name                                 = "karpenter-2025121123055098090000001c"
        tags                                 = {
            "Environment" = "prod"
            "ManagedBy"   = "terraform"
            "Owner"       = "platform-team"
            "Project"     = "platform"
            "Tier"        = "critical"
        }
        # (17 unchanged attributes hidden)

      ~ iam_instance_profile {
          ~ arn  = "arn:aws:iam::107363237542:instance-profile/karpenter-prod-node-group-2025121122553714730000000f" -> (known after apply)
            name = null
        }

        # (5 unchanged blocks hidden)
    }

Plan: 35 to add, 4 to change, 0 to destroy.
```
